Show / Hide Table of Contents
Enum BarEndExtendType
Type of extension of bar
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum BarEndExtendType
Fields
 Name |  Description
 ExtendByDistance
Extension by distance
 ExtendToSegment
Extension to the end of segment
 No
No extension
 Improve this Doc
 View Source